wsdl-schema-parser/src/test/resources/wsdls/xmethods/http.__www.doughughes.net_WebServices_fortune_fortune.cfc_wsdl.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions targetNamespace="http://fortune.webservices" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="http://fortune.webservices" xmlns:intf="http://fortune.webservices" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns1="http://rpc.xml.coldfusion" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><!--WSDL created by ColdFusion version 8,0,1,195765--> <wsdl:types>  <schema targetNamespace="http://fortune.webservices" xmlns="http://www.w3.org/2001/XMLSchema">   <import namespace="http://xml.apache.org/xml-soap"/>   <import namespace="http://rpc.xml.coldfusion"/>   <import namespace="http://schemas.xmlsoap.org/soap/encoding/"/>   <complexType name="ArrayOf_xsd_anyType">    <complexContent>     <restriction base="soapenc:Array">      <attribute ref="soapenc:arrayType" wsdl:arrayType="xsd:anyType[]"/>     </restriction>    </complexContent>   </complexType>   <complexType name="ArrayOf_xsd_string">    <complexContent>     <restriction base="soapenc:Array">      <attribute ref="soapenc:arrayType" wsdl:arrayType="xsd:string[]"/>     </restriction>    </complexContent>   </complexType>   <complexType name="ArrayOfArrayOf_xsd_anyType">    <complexContent>     <restriction base="soapenc:Array">      <attribute ref="soapenc:arrayType" wsdl:arrayType="xsd:anyType[][]"/>     </restriction>    </complexContent>   </complexType>  </schema>  <schema targetNamespace="http://rpc.xml.coldfusion" xmlns="http://www.w3.org/2001/XMLSchema">   <import namespace="http://fortune.webservices"/>   <import namespace="http://xml.apache.org/xml-soap"/>   <import namespace="http://schemas.xmlsoap.org/soap/encoding/"/>   <complexType name="CFCInvocationException">    <sequence/>   </complexType>   <complexType name="QueryBean">    <sequence>     <element name="columnList" nillable="true" type="impl:ArrayOf_xsd_string"/>     <element name="data" nillable="true" type="impl:ArrayOfArrayOf_xsd_anyType"/>    </sequence>   </complexType>  </schema>  <schema targetNamespace="http://xml.apache.org/xml-soap" xmlns="http://www.w3.org/2001/XMLSchema">   <import namespace="http://fortune.webservices"/>   <import namespace="http://rpc.xml.coldfusion"/>   <import namespace="http://schemas.xmlsoap.org/soap/encoding/"/>   <complexType name="mapItem">    <sequence>     <element name="key" nillable="true" type="xsd:anyType"/>     <element name="value" nillable="true" type="xsd:anyType"/>    </sequence>   </complexType>   <complexType name="Map">    <sequence>     <element maxOccurs="unbounded" minOccurs="0" name="item" type="apachesoap:mapItem"/>    </sequence>   </complexType>  </schema> </wsdl:types>   <wsdl:message name="CFCInvocationException">      <wsdl:part name="fault" type="tns1:CFCInvocationException"/>   </wsdl:message>   <wsdl:message name="getTopicsListResponse">      <wsdl:part name="getTopicsListReturn" type="xsd:string"/>   </wsdl:message>   <wsdl:message name="getTopicsArrayResponse">      <wsdl:part name="getTopicsArrayReturn" type="impl:ArrayOf_xsd_anyType"/>   </wsdl:message>   <wsdl:message name="getFortunesByPatternRequest">      <wsdl:part name="regex" type="xsd:string"/>      <wsdl:part name="caseSensitive" type="xsd:boolean"/>      <wsdl:part name="topics" type="xsd:string"/>      <wsdl:part name="minLength" type="xsd:double"/>      <wsdl:part name="maxLength" type="xsd:double"/>   </wsdl:message>   <wsdl:message name="getTopicsListRequest">   </wsdl:message>   <wsdl:message name="getFortuneRequest">      <wsdl:part name="topics" type="xsd:string"/>      <wsdl:part name="minLength" type="xsd:double"/>      <wsdl:part name="maxLength" type="xsd:double"/>   </wsdl:message>   <wsdl:message name="getFortunesByPatternResponse">      <wsdl:part name="getFortunesByPatternReturn" type="impl:ArrayOf_xsd_anyType"/>   </wsdl:message>   <wsdl:message name="getFortuneByPatternResponse">      <wsdl:part name="getFortuneByPatternReturn" type="xsd:string"/>   </wsdl:message>   <wsdl:message name="getFortuneResponse">      <wsdl:part name="getFortuneReturn" type="xsd:string"/>   </wsdl:message>   <wsdl:message name="getTopicsArrayRequest">   </wsdl:message>   <wsdl:message name="getFortuneByPatternRequest">      <wsdl:part name="regex" type="xsd:string"/>      <wsdl:part name="caseSensitive" type="xsd:boolean"/>      <wsdl:part name="topics" type="xsd:string"/>      <wsdl:part name="minLength" type="xsd:double"/>      <wsdl:part name="maxLength" type="xsd:double"/>   </wsdl:message>   <wsdl:portType name="Fortune">      <wsdl:operation name="getTopicsArray">         <wsdl:input message="impl:getTopicsArrayRequest" name="getTopicsArrayRequest"/>         <wsdl:output message="impl:getTopicsArrayResponse" name="getTopicsArrayResponse"/>         <wsdl:fault message="impl:CFCInvocationException" name="CFCInvocationException"/>      </wsdl:operation>      <wsdl:operation name="getFortune" parameterOrder="topics minLength maxLength">         <wsdl:input message="impl:getFortuneRequest" name="getFortuneRequest"/>         <wsdl:output message="impl:getFortuneResponse" name="getFortuneResponse"/>         <wsdl:fault message="impl:CFCInvocationException" name="CFCInvocationException"/>      </wsdl:operation>      <wsdl:operation name="getTopicsList">         <wsdl:input message="impl:getTopicsListRequest" name="getTopicsListRequest"/>         <wsdl:output message="impl:getTopicsListResponse" name="getTopicsListResponse"/>         <wsdl:fault message="impl:CFCInvocationException" name="CFCInvocationException"/>      </wsdl:operation>      <wsdl:operation name="getFortuneByPattern" parameterOrder="regex caseSensitive topics minLength maxLength">         <wsdl:input message="impl:getFortuneByPatternRequest" name="getFortuneByPatternRequest"/>         <wsdl:output message="impl:getFortuneByPatternResponse" name="getFortuneByPatternResponse"/>         <wsdl:fault message="impl:CFCInvocationException" name="CFCInvocationException"/>      </wsdl:operation>      <wsdl:operation name="getFortunesByPattern" parameterOrder="regex caseSensitive topics minLength maxLength">         <wsdl:input message="impl:getFortunesByPatternRequest" name="getFortunesByPatternRequest"/>         <wsdl:output message="impl:getFortunesByPatternResponse" name="getFortunesByPatternResponse"/>         <wsdl:fault message="impl:CFCInvocationException" name="CFCInvocationException"/>      </wsdl:operation>   </wsdl:portType>   <wsdl:binding name="fortune.cfcSoapBinding" type="impl:Fortune">      <wsdlsoap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>      <wsdl:operation name="getTopicsArray">         <wsdlsoap:operation soapAction=""/>         <wsdl:input name="getTopicsArrayRequest">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:input>         <wsdl:output name="getTopicsArrayResponse">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:output>         <wsdl:fault name="CFCInvocationException">            <wsdlsoap:fault encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" name="CFCInvocationException" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:fault>      </wsdl:operation>      <wsdl:operation name="getFortune">         <wsdlsoap:operation soapAction=""/>         <wsdl:input name="getFortuneRequest">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:input>         <wsdl:output name="getFortuneResponse">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:output>         <wsdl:fault name="CFCInvocationException">            <wsdlsoap:fault encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" name="CFCInvocationException" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:fault>      </wsdl:operation>      <wsdl:operation name="getTopicsList">         <wsdlsoap:operation soapAction=""/>         <wsdl:input name="getTopicsListRequest">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:input>         <wsdl:output name="getTopicsListResponse">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:output>         <wsdl:fault name="CFCInvocationException">            <wsdlsoap:fault encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" name="CFCInvocationException" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:fault>      </wsdl:operation>      <wsdl:operation name="getFortuneByPattern">         <wsdlsoap:operation soapAction=""/>         <wsdl:input name="getFortuneByPatternRequest">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:input>         <wsdl:output name="getFortuneByPatternResponse">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:output>         <wsdl:fault name="CFCInvocationException">            <wsdlsoap:fault encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" name="CFCInvocationException" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:fault>      </wsdl:operation>      <wsdl:operation name="getFortunesByPattern">         <wsdlsoap:operation soapAction=""/>         <wsdl:input name="getFortunesByPatternRequest">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:input>         <wsdl:output name="getFortunesByPatternResponse">            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:output>         <wsdl:fault name="CFCInvocationException">            <wsdlsoap:fault encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" name="CFCInvocationException" namespace="http://fortune.webservices" use="encoded"/>         </wsdl:fault>      </wsdl:operation>   </wsdl:binding>   <wsdl:service name="fortune">  <wsdl:documentation xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">I am a web services version of the popular BSD/Linux amusement/game Fortune.  </wsdl:documentation>      <wsdl:port binding="impl:fortune.cfcSoapBinding" name="fortune.cfc">         <wsdlsoap:address location="http://www.doughughes.net/WebServices/fortune/fortune.cfc"/>      </wsdl:port>   </wsdl:service></wsdl:definitions>